In [1]:
import pandas as pd

In [2]:
#leitura dos arquivos
df1 = pd.read_excel("C:/Users/jessica/Desktop/analise de dados com python e pandas/datasets/Aracaju.xlsx")
df2 = pd.read_excel("C:/Users/jessica/Desktop/analise de dados com python e pandas/datasets/Fortaleza.xlsx")
df3 = pd.read_excel("C:/Users/jessica/Desktop/analise de dados com python e pandas/datasets/Natal.xlsx")
df4 = pd.read_excel("C:/Users/jessica/Desktop/analise de dados com python e pandas/datasets/Recife.xlsx")
df5 = pd.read_excel("C:/Users/jessica/Desktop/analise de dados com python e pandas/datasets/Salvador.xlsx")

In [3]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [4]:
#juntando todos os arquivos em um s√≥
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
df.head(5)

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
#ultimas 5 linhas
df.tail(5)

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [8]:
#pegar 5 linhas de amostra 
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
64   Salvador 2019-01-01   37.96    1037     3
89     Recife 2019-01-01   18.11     980     3
176     Natal 2019-01-02   19.42    1035     3
140     Natal 2019-01-02   20.79    1036     2
158     Natal 2019-01-02  183.64    1037     3

In [9]:
#verificando tipo de dado de cada coluna 
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [10]:
#alterando tipo de dado de cada coluna 
df["LojaID"] = df["LojaID"].astype("object")

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
#tratando valores faltantes 
#consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [17]:
#apagando linha com valores nulos 
df.dropna(inplace=True)

In [18]:
#removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

In [19]:
#criando coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [20]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [21]:
#retornando a maior receita
df["Receita"].max()

3544.0

In [22]:
#retornando o maior valor 
df["Receita"].min()

3.34

In [23]:
#nlargest escolhe top 3 com base na coluna escolhida
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [26]:
#nsmallest escolhe as 3 piores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [27]:
#agrupamento por cidade 
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [28]:
#ordenando o conjunt de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0
38  Natal 2018-02-25   828.0    852     4   3312.0
10  Natal 2018-10-27   828.0    852     4   3312.0
69  Natal 2019-03-24   817.0    852     4   3268.0
62  Natal 2018-02-10   793.0    854     4   3172.0
52  Natal 2018-04-27   778.0    854     4   3112.0

In [ ]:
############################### TRABALHANDO COM DATA

In [29]:
#transformando a coluna data em tipo inteiro 
df["Data"] = df["Data"].astype("int64")

In [30]:
#verificando tipo de dado de cada coluna
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID      object
Qtde         int64
Receita    float64
dtype: object

In [31]:
#verificando tipo de dado de cada coluna
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID      object
Qtde         int64
Receita    float64
dtype: object

In [32]:
#transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [33]:
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
dtype: object

In [35]:
#agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [36]:
#CRIANDO UMA NOVA COLUNA COM ANO
df["Ano_Venda"] = df["Data"].dt.year

In [38]:
df.sample(5)

       Cidade       Data  Vendas LojaID  Qtde  Receita  Ano_Venda
211     Natal 2019-01-02  141.05   1035     3   423.15       2019
74     Recife 2019-01-01   38.79    983     6   232.74       2019
38    Aracaju 2018-01-01  142.46   1520     1   142.46       2018
24   Salvador 2019-01-01   15.60   1034     2    31.20       2019
26      Natal 2018-07-20  370.00    853     3  1110.00       2018

In [39]:
#extraindo mes e dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [40]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda
5,Aracaju,2018-01-01,156.20,1522,1,156.20,2018,1,1
195,Natal,2019-01-02,44.89,1036,3,134.67,2019,1,2
101,Natal,2019-01-02,32.28,1035,3,96.84,2019,1,2
136,Recife,2019-03-02,39.09,982,4,156.36,2019,3,2
125,Recife,2019-03-02,37.60,983,4,150.40,2019,3,2

In [41]:
#retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [44]:
#calculando a diferen√ßa de dias
df["diferenca_dias"] = df["Data"] = df["Data"].min()

In [45]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,diferenca_dias
24,Salvador,2018-01-01,15.60,1034,2,31.20,2019,1,1,2018-01-01
14,Salvador,2018-01-01,109.01,1035,2,218.02,2019,1,12,2018-01-01
112,Aracaju,2018-01-01,4.52,1522,8,36.16,2018,1,1,2018-01-01
152,Salvador,2018-01-01,20.07,1035,1,20.07,2019,1,2,2018-01-01
62,Fortaleza,2018-01-01,106.21,1005,6,637.26,2019,1,1,2018-01-01

In [47]:
#criando a coluna de trimestre
df["semestre_venda"] = df["Data"].dt.quarter

In [48]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,diferenca_dias,semestre_venda
51,Fortaleza,2018-01-01,30.47,1005,3,91.41,2019,1,1,2018-01-01,1
84,Salvador,2018-01-01,22.99,1036,1,22.99,2019,1,1,2018-01-01,1
71,Recife,2018-01-01,138.69,983,3,416.07,2019,1,1,2018-01-01,1
90,Aracaju,2018-01-01,16.27,1522,1,16.27,2018,1,1,2018-01-01,1
18,Fortaleza,2018-01-01,38.31,1002,3,114.93,2019,1,1,2018-01-01,1

In [50]:
#filtrando as vendas de 2019 do mes de mar√ßo
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [55]:
vendas_marco_19

Empty DataFrame
Columns: [Cidade, Data, Vendas, LojaID, Qtde, Receita, Ano_Venda, mes_venda, dia_venda, diferenca_dias, semestre_venda]
Index: []